
// ІНКРЕМЕНТУВАННЯ ТА ДЕКРЕМЕНТУВАННЯ

var highFives = 0;
++highFives; // Інкрементування збільшує значення на один, повертає нове значення
1 // нове значення
--highFives; // Декрементування, зменшує значення змінної на один, повертає нове значення
0;
highFives++; // Інкрементування, повертає значення, яке було перед інкрементуванням
highFives--; // Декрементування, повертає значення, яке було перед декрементуванням

// += -=

let x = 10;
x += 5; // додає значення змінній
15
x -= 5; // віднімає значення змінній
10
x *= 5; // множить значення змінної
50
x /= 5; // ділить значення змінної
10

// З'ЄДНУВАННЯ РЯДКІВ

let greeting = "Hello";
let myName = "Nick"
greeting + myName;
"HelloNick" // З'єднування двох рядків

let newGreeting = "Hello ";
let myNewName = "Nick"
newGreeting + myNewName;
"Hello Nick" // З'єднування двох рядків, але після Hello поставили пробіл, щоб він відображався у новому значенні

// ВИЗНАЧАЄМО ДОВЖИНУ РЯДКА

"supercalifragilisticexpialodocious".length; // Визначаємо довжину рядка, повертає нам число
34


